Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: །འདུས་མ་བྱས་ཀྱི་ཁམས་མཚན་མ་མེད་ཅེས་བྱ་བར་རྣམ་པར་རྟོག་པར་མི་འགྱུར། མཚན་མ་མེད་པ་འདུས་མ་བྱས་ཀྱི་ཁམས་ཤེས་བྱ་བར་རྣམ་པར་རྟོག་པར་མི་འགྱུར་རོ།
en: They will not construe the notion that the unconditioned elements are signless, and they will not construe the notion that signlessness is the unconditioned elements.

source: །འདུས་མ་བྱས་ཀྱི་ཁམས་སྨོན་པ་མེད་ཅེས་བྱ་བར་རྣམ་པར་རྟོག་པར་མི་འགྱུར། སྨོན་པ་མེད་པ་འདུས་མ་བྱས་ཀྱི་ཁམས་ཤེས་བྱ་བར་རྣམ་པར་རྟོག་པར་མི་འགྱུར་རོ།
en: They will not construe the notion that the unconditioned elements are wishless, and they will not construe the notion that wishlessness is the unconditioned elements.

source: །འདུས་མ་བྱས་ཀྱི་ཁམས་སྐྱེ་བ་མེད་ཅེས་བྱ་བར་རྣམ་པར་རྟོག་པར་མི་འགྱུར། སྐྱེ་བ་མེད་པ་འདུས་མ་བྱས་ཀྱི་ཁམས་ཤེས་བྱ་བར་རྣམ་པར་རྟོག་པར་མི་འགྱུར་རོ།
en: They will not construe the notion that the unconditioned elements are nonarising, and they will not construe the notion that nonarising is the unconditioned elements.

source: །འདུས་མ་བྱས་ཀྱི་ཁམས་འགག་པ་མེད་ཅེས་བྱ་བར་རྣམ་པར་རྟོག་པར་མི་འགྱུར། འགག་པ་མེད་པ་འདུས་མ་བྱས་ཀྱི་ཁམས་ཤེས་བྱ་བར་རྣམ་པར་རྟོག་པར་མི་འགྱུར་རོ།
en: They will not construe the notion that the unconditioned elements are unceasing, and they will not construe the notion that noncessation is the unconditioned elements.

source: །འདུས་མ་བྱས་ཀྱི་ཁམས་ཞི་ཞེས་བྱ་བར་རྣམ་པར་རྟོག་པར་མི་འགྱུར། །ཞི་བ་འདུས་མ་བྱས་ཀྱི་ཁམས་ཤེས་བྱ་བར་རྣམ་པར་རྟོག་པར་མི་འགྱུར་རོ།
en: They will not construe the notion that the unconditioned elements are peace, and they will not construe the notion that peace is the unconditioned elements. {Ki.

source: །འདུས་མ་བྱས་ཀྱི་ཁམས་དབེན་ཞེས་བྱ་བར་རྣམ་པར་རྟོག་པར་མི་འགྱུར། དབེན་པ་འདུས་མ་བྱས་ཀྱི་ཁམས་ཤེས་བྱ་བར་རྣམ་པར་རྟོག་པར་མི་འགྱུར་རོ།
en: II-III: 18} They will not construe the notion that the unconditioned elements are void, and they will not construe the notion that voidness is the unconditioned elements. “

source: །ལྷའི་བུ་དག་རྣམ་གྲངས་དེས་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དེ་ལྟར་ཟབ་པ་ནས། དེ་ལྟར་ཤིན་དུ་འཕགས་པ། དེ་ལྟར་མཁས་ཤིང་ཤེས་པས་རིག་པར་བྱ་བའི་བར་དེ་ལ། ཡིད་ཆེས་པར་བྱེད་པ་སུ་ཡང་མེད་དོ།
en: Divine princes, this formulation explains how there is no one at all who will have confidence in this perfection of wisdom, since it is so profound, and so forth, and so utterly sublime—so much so that it should be known by the learned and the wise.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་འདི་ལ་ཆོས་གང་ཡང་མ་བརྗོད་མ་བཤད་དེ།
en: If you ask why, it is because nothing at all is expressed and explained in it.

source: ཇི་ལྟར་འདི་ལ་ཆོས་གང་ཡང་མ་བརྗོད་མ་བཤད་པ་དེ་བཞིན་དུ། འདི་ལ་སེམས་ཅན་གང་ཡང་ཡིད་ཆེས་པར་མི་བྱེད་དོ།
en: Insofar as there is nothing at all that is expressed or explained in it, there are no beings at all who will have confidence in it.”

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས། ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཚེ་དང་ལྡན་པ་རབ་འབྱོར་འོ་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ལས་ཐེག་པ་གསུམ་པོ་ཉན་ཐོས་ཀྱི་ཐེག་པ་དང་། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་དང་། ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱི་ཐེག་པ་རྣམས་ཀྱང་རྒྱ་ཆེར་རྣམ་པར་མ་བཀོད་དམ།
en: Then the venerable Śāradvatīputra addressed the venerable Subhūti as follows: “Venerable Subhūti, in this perfection of wisdom, have the three vehicles—that is to say, the vehicle of the śrāvakas, the vehicle of the pratyekabuddhas, and the vehicle of the completely awakened buddhas—not been extensively presented?

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཡོངས་སུ་གཟུང་བ་ཡང་མ་བསྟན་ཏམ། སེམས་དང་པོ་བསྐྱེད་པ་ནས། སེམས་བཅུ་པ་བསྐྱེད་པའི་བར་གྱི་བྱང་ཆུབ་སེམས་དཔའི་ལམ་འདི་ལྟ་སྟེ། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་དང་། ཡང་དག་པར་སྤོང་བ་བཞི་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་བཞི་དང་། དབང་པོ་ལྔ་དང་སྟོབས་ལྔ་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་དང་། འཕགས་པའི་བདེན་པ་བཞི་དང་། བསམ་གཏན་བཞི་དང་། ཚད་མེད་པ་བཞི་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་ལྔ་དང་།
en: Has the acceptance of bodhisattva great beings not been taught, and has the path of the bodhisattvas, commencing from the time of their initial setting of the mind on enlightenment and continuing as far as their tenth setting of the mind on enlightenment, also not been taught?

source: ཏིང་ངེ་འཛིན་ཐམས་ཅད་དང་། གཟུངས་ཀྱི་སྒོ་ཐམས་ཅད་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་།
en: That is to say, have the perfection of generosity, the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, the perfection of wisdom, all the aspects of emptiness, the four applications of mindfulness, the four correct exertions, the four supports for miraculous ability, the five faculties, the five powers, the seven branches of enlightenment, the noble eightfold path, the four truths of the noble ones, the four meditative concentrations, the four immeasurable attitudes, the four formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, the gateways of liberation—emptiness, signlessness, and wishlessness—the five extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, and the distinct qualities of the buddhas also not been taught? “

source: སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཀྱང་མ་བསྟན་ཏམ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་མངོན་པར་ཤེས་པ་དང་། རྫུ་འཕྲུལ་གྱིས་རྣམ་པར་རྩེ་བ་རྣམས་ཀྱང་མ་བསྟན་ཏམ། དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་རྫུས་ཏེ་སྐྱེ་བར་འགྱུར་ཞེས་མི་བྱའམ། དེས་ན་མངོན་པར་ཤེས་པ་རྣམས་ལ་ཡོངས་སུ་ཉམ་པ་མེད་པའི་ཆོས་ཅན་དུ་འགྱུར་ཞེས་མི་བྱའམ། སངས་རྒྱས་ཀྱི་ཞིང་ནས་སངས་རྒྱས་ཀྱི་ཞིང་དུ་འདོང་ཞིང་། དགེ་བའི་རྩ་བ་གང་གིས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ལ་རིམ་གྲོར་བྱ་བ་དང་། བཀུར་སྟིར་བྱ་བ་དང་།
en: Has the emanational play of bodhisattva great beings, owing to their extrasensory power and miraculous ability, not also been taught?

source: བསྟི་སྟང་དུ་བྱ་བ་དང་། མཆོད་པར་བྱ་བར་འདོད་པ་དེ་ལྟ་བུའི་དགེ་བའི་རྩ་བ་དེ་དག་ཀྱང་ཕུན་སུམ་ཚོགས་པར་འགྱུར་ཞེས་མི་བྱའམ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ལས་ཆོས་གང་ཐོས་པ་དེ་ཡང་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་མ་གྱུར་གྱི་བར་དུ་ནམ་ཡང་རྒྱུན་ཆད་པར་མི་འགྱུར་རོ་ཞེས་མི་བྱའམ། འཁྲུག་པ་མེད་པ་དང་། མཉམ་པར་གཞག་པ་མེད་པའི་ཚུལ་གྱིས་རྟག་ཏུ་མཉམ་པར་གཞག་པར་འགྱུར་རོ་ཞེས་མི་བྱའམ། ཐོགས་པ་མེད་པའི་སྤོབས་པ་དང་། རྒྱུན་འཆད་པ་མེད་པའི་སྤོབས་པ་དང་། མཉམ་པར་གཞག་པའི་སྤོབས་པ་དང་།
en: And then is it not the case that bodhisattva great beings will practice the perfection of wisdom and take birth miraculously; is it not the case that they will have extrasensory powers that know no diminishing; is it not the case that they will indeed be excellently endowed with those roots of virtuous action through which they will seek to serve, respect, honor, and worship those lord buddhas; is it not the case that they will never interrupt the continuity of any Dharmas that they hear from those lord buddhas, until they have attained all-aspect omniscience; is it not the case that they will always be absorbed [in meditation], without lacking meditative absorption; and is it not the case that they will be endowed with inspired speech that is unimpeded, inspired speech that is uninterrupted, inspired speech that is rational, inspired speech that is well connected, inspired speech that is purposeful, and inspired speech that is distinguished and supramundane?”{Ki.

source: རིགས་པའི་སྤོབས་པ་དང་། འབྲེལ་བའི་སྤོབས་པ་དང་། དོན་དང་ལྡན་པའི་སྤོབས་པ་དང་། འཇིག་རྟེན་ཐམས་ཅད་ལས་མངོན་པར་འཕགས་ཤིང་ཁྱད་ཞུགས་པའི་སྤོབས་པ་དང་ཡང་ལྡན་པར་འགྱུར་ཞེས་མི་བྱ་འམ།
en: II-III: 19} “Venerable Śāradvatīputra, it is so!”

source: རབ་འབྱོར་གྱིས་སྨྲས་པ། ཚེ་དང་ལྡན་པ་ཤར་དྭ་ཏིའི་བུ།
en: replied Subhūti. “

source: དེ་དེ་བཞིན་ནོ། །ཇི་སྐད་དུ་སྨྲས་པ་དེ་དེ་བཞིན་ཏེ།
en: It is just as you have said.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ལས་ཐེག་པ་གསུམ་པོ་ཉན་ཐོས་ཀྱི་ཐེག་པ་དང་། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་དང་། ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱི་ཐེག་པ་རྣམས་ཀྱང་རྒྱ་ཆེར་བསྟན་ཏོ།
en: In this perfection of wisdom, the three vehicles—that is to say, the vehicle of the śrāvakas, the vehicle of the pratyekabuddhas, and the vehicle of the completely awakened buddhas—have been extensively taught.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡོངས་སུ་གཟུང་བ་ཡང་བསྟན། འཇིག་རྟེན་ཐམས་ཅད་ལས་མངོན་པར་འཕགས་ཤིང་ཁྱད་ཞུགས་པའི་སྤོབས་པ་དང་ལྡན་པའི་བར་དུ་ཡང་འགྱུར་ཞེས་བྱའོ། །དེ་ཡང་མི་དམིགས་པའི་ཚུལ་གྱིས་ཏེ། གང་མི་དམིགས་པའི་ཚུལ་གྱིས་ཤེ་ན་བདག་མི་དམིགས་པའི་ཚུལ་དང་། སེམས་ཅན་དང་། སྲོག་དང་། འགྲོ་བ་དང་། གསོ་བ་དང་། སྐྱེས་བུ་དང་། གང་ཟག་དང་། ཤེད་ཅན་དང་། ཤེད་བདག་དང་། བྱེད་པ་པོ་དང་། ཚོར་བ་པོ་དང་། ཤེས་པ་པོ་དང་། མཐོང་བ་པོ་མི་དམིགས་པའི་ཚུལ་དང་། གཟུགས་མི་དམིགས་པའི་ཚུལ་དང་། ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་མི་དམིགས་པའི་ཚུལ་དང་། མིག་མི་དམིགས་པའི་ཚུལ་དང་། རྣ་བ་དང་སྣ་དང་། ལྕེ་དང་། ལུས་དང་། ཡིད་མི་དམིགས་པའི་ཚུལ་དང་། གཟུགས་མི་དམིགས་པའི་ཚུལ་དང་། སྒྲ་དང་། དྲི་དང་། རོ་དང་། རེག་དང་། ཆོས་མི་དམིགས་པའི་ཚུལ་དང་། མིག་གི་རྣམ་པར་ཤེས་པ་མི་དམིགས་པའི་ཚུལ་དང་། རྣ་བའི་རྣམ་པར་ཤེས་པ་དང་། སྣའི་རྣམ་པར་ཤེས་པ་དང་། ལྕེའི་རྣམ་པར་ཤེས་པ་དང་།
en: The acceptance of bodhisattva great beings has also been taught, and it is the case that [all those other attributes you mentioned] will come about, up to and including the endowment of inspired speech that is distinguished and supramundane, but they will do so without anything being apprehended! “

source: ལུས་ཀྱི་རྣམ་པར་ཤེས་པ་དང་། ཡིད་ཀྱི་རྣམ་པར་ཤེས་པ་མི་དམིགས་པའི་ཚུལ་དང་། མིག་གི་འདུས་ཏེ་རེག་པ་མི་དམིགས་པའི་ཚུལ་དང་། རྣ་བའི་འདུས་ཏེ་རེག་པ་དང་། སྣའི་འདུས་ཏེ་རེག་པ་དང་། ལྕེའི་འདུས་ཏེ་རེག་པ་དང་། ལུས་ཀྱི་འདུས་ཏེ་རེག་པ་དང་། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པ་མི་དམིགས་པའི་ཚུལ་དང་། མིག་གི་འདུས་ཏེ་རེག་པ་ལས་བྱུང་བའི་ཚོར་བ་མི་དམིགས་པའི་ཚུལ་དང་། རྣ་བའི་འདུས་ཏེ་རེག་པ་ལས་བྱུང་པའི་ཚོར་བ་དང་། སྣའི་འདུས་ཏེ་རེག་པ་ལས་བྱུང་བའི་ཚོར་བ་དང་། ལྕེའི་འདུས་ཏེ་རེག་པ་ལས་བྱུང་བའི་ཚོར་བ་དང་། ལུས་ཀྱི་འདུས་ཏེ་རེག་པ་ལས་བྱུང་བའི་ཚོར་བ་དང་། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པ་ལས་བྱུང་བའི་ཚོར་བ་མི་དམིགས་པའི་ཚུལ་དང་། སའི་ཁམས་མི་དམིགས་པའི་ཚུལ་དང་། ཆུའི་ཁམས་དང་། མེའི་ཁམས་དང་། རླུང་གི་ཁམས་དང་། ནམ་མཁའི་ཁམས་དང་། རྣམ་པར་ཤེས་པའི་ཁམས་མི་དམིགས་པའི་ཚུལ་དང་། མ་རིག་པ་མི་དམིགས་པའི་ཚུལ་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་དང་། མིང་དང་གཟུགས་དང་། སྐྱེ་མཆེད་དྲུག་དང་། རེག་པ་དང་། ཚོར་བ་དང་། སྲེད་པ་དང་། ལེན་པ་དང་། སྲིད་པ་དང་། སྐྱེ་བ་དང་། རྒ་ཤི་མི་དམིགས་པའི་ཚུལ་དང་། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་མི་དམིགས་པའི་ཚུལ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མི་དམིགས་པའི་ཚུལ་དང་། ནང་སྟོང་པ་ཉིད་མི་དམིགས་པའི་ཚུལ་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ་མི་དམིགས་པའི་ཚུལ་དང་། དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་མི་དམིགས་པའི་ཚུལ་དང་། ཡང་དག་པར་སྤོང་བ་རྣམས་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་རྣམས་དང་། དབང་པོ་རྣམས་དང་། སྟོབས་རྣམས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་རྣམས་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་མི་དམིགས་པའི་ཚུལ་དང་། འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་པ་རྣམས་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་མི་དམིགས་པའི་ཚུལ་དང་།
en: If you ask what is it that is not apprehended, this will come about without a self being apprehended; without sentient beings, life forms, living beings, life, living creatures, individuals, human beings, people, actors, experiencers, knowers, or viewers being apprehended; without physical forms being apprehended; without feelings, perceptions, formative predispositions, or consciousness being apprehended; without the eyes being apprehended; without the ears, nose, tongue, body, or mental faculty being apprehended; without sights being apprehended; without sounds, odors, tastes, tangibles, or mental phenomena being apprehended; without visual consciousness being apprehended; without auditory consciousness, olfactory consciousness, gustatory consciousness, tactile consciousness, or mental consciousness being apprehended; without visually compounded sensory contact being apprehended; without aurally compounded sensory contact, nasally compounded sensory contact, lingually compounded sensory contact, corporeally compounded sensory contact, or mentally compounded sensory contact being apprehended; without feelings arising from visually compounded sensory contact being apprehended; without feelings arising from aurally compounded sensory contact, feelings arising from nasally compounded sensory contact, feelings arising from lingually compounded sensory contact, feelings arising from corporeally compounded sensory contact, or feelings arising from mentally compounded sensory contact being apprehended; without the earth element being apprehended; without the water element, the fire element, the wind element, the space element, or the consciousness element being apprehended; without ignorance being apprehended; without formative predispositions, consciousness, name and form, the six sense fields, sensory contact, sensation, craving, grasping, the rebirth process, actual birth, or aging and death being apprehended; without the perfection of generosity being apprehended; without the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, or the perfection of wisdom being apprehended; without the emptiness of internal phenomena being apprehended; without the [other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, being apprehended; without the applications of mindfulness being apprehended; without the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, or the noble eightfold path being apprehended; without the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, the gateways of liberation—emptiness, signlessness, and wishlessness—the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, great loving kindness, great compassion, or the eighteen distinct qualities of the buddhas being apprehended; and without the [fruits and realizations], up to and including all-aspect omniscience, being apprehended.”

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་མི་དམིགས་པའི་ཚུལ་གྱིས་རྣམ་པ་དེ་ལྟ་བུར་འགྱུར་རོ། །དེ་ནས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས། ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ཅིའི་ཕྱིར་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ལས་མི་དམིགས་པའི་ཚུལ་གྱིས་ཐེག་པ་གསུམ་རྒྱ་ཆེར་བསྟན།
en: Then the venerable Śāradvatīputra inquired of the venerable Subhūti, “Venerable Subhūti, why in this perfection of wisdom are the three vehicles extensively taught without anything being apprehended?

source: ཅིའི་ཕྱིར་ན་མི་དམིགས་པའི་ཚུལ་གྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ། ཡོངས་སུ་གཟུང་བ་བསྟན། ཅིའི་ཕྱིར་ན་མི་དམིགས་པའི་ཚུལ་གྱིས་འཇིག་རྟེན་ཐམས་ཅད་ལས་མངོན་པར་འཕགས་ཤིང་ཁྱད་ཞུགས་པའི་སྤོབས་པ་དང་ལྡན་པའི་བར་དུ་ཡིན།
en: Similarly, why is the acceptance of bodhisattva great beings taught without anything being apprehended, and why do [all those other attributes I mentioned], up to and including the endowment of inspired speech that is distinguished and supramundane, come about, without anything being apprehended?”

source: དེ་སྐད་ཅེས་སྨྲས་པ་དང་། ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ནང་སྟོང་པ་ཉིད་དང་།
en: The venerable Subhūti replied to the venerable Śāradvatīputra, “Venerable Śāradvatīputra, it is owing to the emptiness of internal phenomena, {Ki.

source: ཕྱི་སྟོང་པ་ཉིད་དང་། ཕྱི་ནང་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར། མི་དམིགས་པའི་ཚུལ་གྱིས་ཐེག་པ་གསུམ་རྒྱ་ཆེར་བསྟན་ཏོ།
en: II-III: 20} the emptiness of external phenomena, and [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, that the three vehicles have been extensively taught without anything being apprehended.

source: །དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་གྱི་ཕྱིར་མི་དམིགས་པའི་ཚུལ་གྱིས་ཐེག་པ་གསུམ་རྒྱ་ཆེར་བསྟན་ཏོ། །ནང་སྟོང་པ་ཉིད་དང་། ཕྱི་སྟོང་པ་ཉིད་དང་། ཕྱི་ནང་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར་མི་དམིགས་པའི་ཚུལ་གྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཡོངས་སུ་གཟུང་བ་བསྟན་ཏོ།
en: It is owing to the emptiness of internal phenomena, the emptiness of external phenomena, and [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, that the acceptance of bodhisattva great beings has been taught.

source: །མི་དམིགས་པའི་ཚུལ་གྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་འཇིག་རྟེན་ཐམས་ཅད་ལས་མངོན་པར་འཕགས་ཤིང་ཁྱད་ཞུགས་པའི་སྤོབས་པའི་བར་དང་ཡང་ལྡན་པར་འགྱུར་རོ།
en: Bodhisattva great beings will be endowed with inspired speech that is distinguished and supramundane, without anything being apprehended.”

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ་ལས། ལེའུ་བཅོ་ལྔ་པའོ།། །།
en: This completes the fifteenth chapter from “The Perfection of Wisdom in Twenty-Five Thousand Lines.”

source: དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་འདི་སྙམ་དུ་སེམས་པར་གྱུར་ཏེ། གནས་བརྟན་རབ་འབྱོར་གྱིས་དེ་ལྟར་ཆོས་ཀྱི་ཆར་བ་འདི་ཕབ་སྟེ་བསྟན་ན། དེ་ལ་བདག་གིས་ཀྱང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ལ་མཆོད་པ་བྱ་བའི་ཕྱིར། མེ་ཏོག་མང་པོ་མངོན་པར་སྤྲུལ་ཏེ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་དང་། དགེ་སློང་གི་དགེ་འདུན་རྣམས་དང་། གནས་བརྟན་རབ་འབྱོར་ལ་གཏོར་བར་བྱའོ། །མངོན་པར་གཏོར་བར་བྱའོ། །རབ་ཏུ་གཏོར་བར་བྱའོ་སྙམ་མོ།
en: Chapter 16 Then Śakra, mighty lord of the gods, thought, “Since the elder Subhūti is teaching in this manner, causing this cascade of the Dharma, I should also conjure up many flowers in order to worship this perfection of wisdom and scatter them, widely scatter them, and thoroughly scatter them upon the Lord Buddha, the bodhisattva great beings, the saṅgha of monks, and the elder Subhūti.”

source: །དེ་ནས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ན་རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷ་དང་། འོག་མིན་གྱི་བར་གྱི་ལྷ་ཇི་སྙེད་ཡོད་པ་དེ་དག་ཀྱང་འདི་སྙམ་དུ་སེམས་པར་གྱུར་ཏེ། དེ་ལྟར་གནས་བརྟན་རབ་འབྱོར་གྱིས་ཆོས་ཀྱི་ཆར་པ་འདི་ཕབ་སྟེ་བསྟན་ན། དེ་ལ་བདག་ཅག་གིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ལ་མཆོད་པ་བྱ་བའི་ཕྱིར། མེ་ཏོག་མང་པོ་མངོན་པར་སྤྲུལ་ཏེ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་དང་། དགེ་སློང་གི་དགེ་འདུན་རྣམས་དང་། གནས་བརྟན་རབ་འབྱོར་ལ་གཏོར་བར་བྱའོ། །མངོན་པར་གཏོར་བར་བྱའོ། །རབ་ཏུ་གཏོར་བར་བྱའོ་སྙམ་མོ།
en: Then all the gods in this great trichiliocosm, from the Caturmahā­rāja­kāyika realm, up to and including Akaniṣṭha, also had the thought, “Since the elder Subhūti is teaching in this manner, causing this cascade of the Dharma, we should also conjure up many flowers in order to worship this perfection of wisdom and scatter them, manifestly scatter them, and thoroughly scatter them upon the Lord Buddha, the bodhisattva great beings, the saṅgha of monks, and the elder Subhūti.”

source: །དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་དང་། སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷ་དང་། འོག་མིན་གྱི་བར་གྱི་ལྷ་དེ་དག་ཐམས་ཅད་ཀྱང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ལ་མཆོད་པ་བྱ་བའི་ཕྱིར། ལྷ་རྫས་ཀྱི་མེ་ཏོག་མན་དཱ་ར་བ་མང་པོ་མངོན་པར་སྤྲུལ་ཏེ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་དང་། དགེ་སློང་གི་དགེ་འདུན་རྣམས་དང་།
en: Then Śakra, mighty lord of the gods, and also all the gods in this great trichiliocosm, from the Caturmahā­rāja­kāyika realm, up to and including Akaniṣṭha, conjured up many coral flowers, which are divine sacraments, in order to worship this perfection of wisdom, and then they scattered them, widely scattered them, and thoroughly scattered them upon the Lord Buddha, the bodhisattva great beings, the saṅgha of monks, and the elder Subhūti.

source: གནས་བརྟན་རབ་འབྱོར་ལ་འཐོར་བར་གྱུར་ཏོ། །མངོན་པར་འཐོར་བར་གྱུར་ཏོ། །རབ་ཏུ་འཐོར་བར་གྱུར་ཏོ། །མེ་ཏོག་དེ་དག་གིས་གཏོར་མ་ཐག་ཏུ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདིའི་གཞི་མེ་ཏོག་གིས་ཁེབས་པར་གྱུར་ནས། སྟེང་གི་བར་སྣང་ལ་ཡང་མེ་ཏོག་གི་ཁང་བ་བརྩེགས་པ།
en: As soon as these flowers had been scattered, the ground of this great trichiliocosm was covered with flowers and a delightful and pleasant towering mansion of flowers formed in the sky above, as large as the great trichiliocosm.

source: སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཙམ་མདངས་དགའ་ཞིང་ཡིད་དུ་འོང་བ་ཀུན་ནས་གནས་པར་གྱུར་ཏོ། །དེ་ནས་གནས་བརྟན་རབ་འབྱོར་འདི་སྙམ་དུ་སེམས་པར་གྱུར་ཏེ་འདི་ལྟར་ལྷ་རྣམས་ཀྱིས་མངོན་པར་གཏོར་བའི་མེ་ཏོག་འདི་དག་ནི་བདག་གིས་སྔོན་ཆད་ལྷའི་གནས་ཐམས་ཅད་ན་ཡང་ཡོད་པར་མ་མཐོང་སྟེ།
en: The elder Subhūti thought, “I have not previously seen even in all the god realms these flowers that the gods are so widely scattering in this manner.

source: མེ་ཏོག་འདི་དག་ནི་སྤྲུལ་པའོ།
en: These flowers have been conjured up.

source: །འདི་ལྟར་ལྷའི་བུ་དག་གིས་མངོན་པར་གཏོར་བའི་མེ་ཏོག་འདི་དག་ནི་ལྡུམ་བུ་ལས་བྱུང་བ་མ་ཡིན།
en: So these flowers that the gods are scattering have not originated from trees.

source: ཆུ་ལས་སྐྱེས་པ་མ་ཡིན།
en: They have not grown from water.

source: ཐང་ལས་སྐྱེས་པ་མ་ཡིན་ནོ།
en: They have not grown from the plains.

source: །འདི་ལྟར་ལྷའི་བུ་དག་གིས་མངོན་པར་གཏོར་བའི་མེ་ཏོག་འདི་དག་ནི་ཡིད་ལས་བྱུང་བ་སྟེ།
en: These flowers that the gods are so widely scattering have originated from mind.

source: མེ་ཏོག་འདི་དག་ནི་ལྡུམ་བུ་ལས་བྱུང་བ་མ་ཡིན་ནོ་སྙམ་པ་དང་།
en: These flowers have not originated from trees.”

source: དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་གནས་བརྟན་རབ་འབྱོར་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །བཙུན་པ་རབ་འབྱོར་མེ་ཏོག་འདི་དག་ནི་མ་བྱུང་བ་སྟེ།
en: Then Śakra, mighty lord of the gods, mentally said to the elder Subhūti, “Blessed Subhūti, these flowers have not originated at all.

source: མེ་ཏོག་འདི་དག་ནི་ཡིད་ལས་བྱུང་བ་མ་ཡིན་ནོ།
en: These flowers have not originated from mind, and they have not originated from trees.” “

source: །ལྡུམ་བུ་ལས་བྱུང་བ་མ་ཡིན་ནོ་སྙམ་མོ། །རབ་འབྱོར་གྱིས་སྨྲས་པ། ཀཽ་ཤི་ཀ་དེ་སྐད་དུ་མེ་ཏོག་འདི་དག་མ་བྱུང་མ་སྐྱེས་པ་སྟེ། མེ་ཏོག་འདི་དག་ཡིད་ལས་བྱུང་བ་མ་ཡིན། ལྡུམ་བུ་ལས་བྱུང་བ་མ་ཡིན་ནོ་ཞེས་ཟེར་བ་ནི།
en: Kauśika,” replied Subhūti, “you have said that these flowers have not originated and have not grown, that these flowers have neither originated from mind, nor have they originated from trees.

source: ཀཽ་ཤི་ཀ་དེ་ལྟར་མ་སྐྱེས་པ་ནི་མེ་ཏོག་ཀྱང་མ་ཡིན་ནོ།
en: Kauśika, since in that way they are nonarising, they are not flowers at all.”

source: །བརྒྱ་བྱིན་གྱིས་སྨྲས་པ། བཙུན་པ་རབ་འབྱོར་མེ་ཏོག་འདི་དག་ཉི་ཚེ་མ་བྱུང་བར་ཟད་དམ། འོན་ཏམ་གཟུགས་ཀྱང་མ་བྱུང་།
en: Śakra responded, “Blessed Subhūti, is it not only these flowers that are ephemeral and unoriginated, but are physical forms also unoriginated?

source: ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ཡང་མ་བྱུང་བ་ཡིན།
en: Are feelings, perceptions, formative predispositions, and consciousness also unoriginated?” {

source: ཀཽ་ཤི་ཀ་མེ་ཏོག་འདི་དག་ཉི་ཚེ་མ་བྱུང་བར་མ་ཟད་ཀྱི། ཀཽ་ཤི་ཀ་གཟུགས་ཀྱང་མ་བྱུང་བ་སྟེ། གང་མ་བྱུང་བ་དེ་ནི་གཟུགས་མ་ཡིན་ནོ།
en: II-III: 21} “Kauśika,” replied Subhūti, “it is not only these flowers that are ephemeral and unoriginated, but, Kauśika, physical forms are also unoriginated, and that which is unoriginated is not physical forms.

source: །ཀཽ་ཤི་ཀ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ཡང་མ་བྱུང་བ་སྟེ། གང་མ་བྱུང་བ་དེ་ནི་རྣམ་པར་ཤེས་པ་མ་ཡིན་ནོ།
en: Kauśika, feelings, perceptions, formative predispositions, and consciousness are also unoriginated, and that which is unoriginated is not consciousness [and so forth].

source: །ཀཽ་ཤི་ཀ་མིག་ནི་མ་བྱུང་བ་སྟེ། གང་མ་བྱུང་བ་དེ་ནི་མིག་མ་ཡིན་ནོ།
en: Kauśika, the eyes are unoriginated, and that which is unoriginated is not the eyes.
